[Killed] BlockStatement
src/operacoes.js:17:22
   return Math.sqrt(n);
 }
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
-function fatorial(n) {
-  if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
-  if (n === 0 || n === 1) return 1;
-  let resultado = n;
-  for (let i = n - 1; i > 1; i--) { resultado *= i; }
-  return resultado;
-}
+function fatorial(n) {}
 function mediaArray(numeros) {
   if (numeros.length === 0) return 0;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] AssignmentOperator
src/operacoes.js:21:37
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
   if (n === 0 || n === 1) return 1;
   let resultado = n;
-  for (let i = n - 1; i > 1; i--) { resultado *= i; }
+  for (let i = n - 1; i > 1; i--) { resultado /= i; }
   return resultado;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 0.6666666666666666

[Killed] ArithmeticOperator
src/operacoes.js:21:16
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
   if (n === 0 || n === 1) return 1;
   let resultado = n;
-  for (let i = n - 1; i > 1; i--) { resultado *= i; }
+  for (let i = n + 1; i > 1; i--) { resultado *= i; }
   return resultado;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 480

[Killed] BlockStatement
src/operacoes.js:83:32
   if (n <= 1) return n;
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
-function produtoArray(numeros) {
-  if (numeros.length === 0) return 1;
-  return numeros.reduce((acc, val) => acc * val);
-}
+function produtoArray(numeros) {}
 function clamp(valor, min, max) {
   if (valor <= min) return min;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] ArrowFunction
src/operacoes.js:85:25
 }
 function produtoArray(numeros) {
   if (numeros.length === 0) return 1;
-  return numeros.reduce((acc, val) => acc * val);
+  return numeros.reduce(() => undefined);
 }
 function clamp(valor, min, max) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:85:39
 }
 function produtoArray(numeros) {
   if (numeros.length === 0) return 1;
-  return numeros.reduce((acc, val) => acc * val);
+  return numeros.reduce((acc, val) => acc / val);
 }
 function clamp(valor, min, max) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 0.16666666666666666

[Killed] BlockStatement
src/operacoes.js:87:33
   if (numeros.length === 0) return 1;
   return numeros.reduce((acc, val) => acc * val);
 }
-function clamp(valor, min, max) {
-  if (valor <= min) return min;
-  if (valor >= max) return max;
-  return valor;
-}
+function clamp(valor, min, max) {}
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:88:7
   return numeros.reduce((acc, val) => acc * val);
 }
 function clamp(valor, min, max) {
-  if (valor <= min) return min;
+  if (false) return min;
   if (valor >= max) return max;
   return valor;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas clamp deve retornar min para valor abaixo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 2

[Killed] ConditionalExpression
src/operacoes.js:88:7
   return numeros.reduce((acc, val) => acc * val);
 }
 function clamp(valor, min, max) {
-  if (valor <= min) return min;
+  if (true) return min;
   if (valor >= max) return max;
   return valor;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/operacoes.js:89:7
 }
 function clamp(valor, min, max) {
   if (valor <= min) return min;
-  if (valor >= max) return max;
+  if (false) return max;
   return valor;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas clamp deve retornar max para valor acima
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 15

[Killed] ConditionalExpression
src/operacoes.js:89:7
 }
 function clamp(valor, min, max) {
   if (valor <= min) return min;
-  if (valor >= max) return max;
+  if (true) return max;
   return valor;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10
